--==================
INSERT INTO employee (name, birth_day) VALUES
('Иван Иванов', '2015-06-01'),
('Мария Петрова', '2018-09-15'),
('Сергей Сидоров','2020-03-22'),
('Алексей Смирнов', '2016-07-10'),
('Елена Кузнецова', '2017-11-20'),
('Дмитрий Васильев', '2019-04-05'),
('Ольга Новикова', '2021-08-30'),
('Павел Морозов',  '2022-01-15');

SELECT * FROM employee;
--==================



--==================
INSERT INTO post (name, respons) VALUES
('Инженер', 'Разработка и тестирование ПО'),
('Менеджер', 'Управление проектами и командой'),
('Аналитик', 'Анализ данных и составление отчетов'),
('Тестировщик', 'Тестирование программного обеспечения'),
('Дизайнер', 'Разработка пользовательских интерфейсов'),
('Бухгалтер', 'Ведение финансовой отчетности'),
('HR-менеджер', 'Подбор и управление персоналом'),
('Системный администратор', 'Обслуживание IT-инфраструктуры');

SELECT * FROM post;
--==================



--==================
INSERT INTO division (name, parent_id) VALUES
('Главная подразделение', NULL),
('Исполнительное подразделение', 1),
('Служба безопасности', 2),
('Программирование',  3),
('Охрана',  4),
('Машинное обучение', 5),
('Пост 1', 6),
('Пост 2', 7),
('NLP', 8);

SELECT * FROM division;
--==================



--==================
INSERT INTO post_division (post_id, division_id) VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(6, 6),
(7, 7),
(8, 8);

SELECT * FROM post_division;
--==================



--==================
INSERT INTO employee_post_division (post_division_id, employee_id, hire_date, retire_date) VALUES
(1, 1, '2015-06-01', NULL),
(2, 2, '2018-09-15', NULL),
(3, 3, '2020-03-22', NULL),
(4, 4, '2016-07-10', NULL),
(5, 5, '2017-11-20', NULL),
(6, 6, '2019-04-05', NULL),
(7, 7, '2021-08-30', NULL),
(8, 8, '2022-01-15', NULL);

SELECT * FROM employee_post_division;
--==================